; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite5 - satellite
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	satellite6 - satellite
	instrument15 - instrument
	instrument16 - instrument
	instrument17 - instrument
	spectrograph1 - mode
	spectrograph0 - mode
	Star3 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	Star5 - direction
	Star0 - direction
	Planet6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star5)
	(supports instrument2 spectrograph0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon10)
	(supports instrument3 spectrograph0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 Star0)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star5)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
	(supports instrument6 spectrograph0)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 Star3)
	(supports instrument7 spectrograph0)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 Star5)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon9)
	(supports instrument8 spectrograph1)
	(calibration_target instrument8 Star5)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
	(supports instrument9 spectrograph1)
	(supports instrument9 spectrograph0)
	(calibration_target instrument9 GroundStation1)
	(calibration_target instrument9 Star5)
	(supports instrument10 spectrograph1)
	(supports instrument10 spectrograph0)
	(calibration_target instrument10 GroundStation1)
	(calibration_target instrument10 GroundStation4)
	(supports instrument11 spectrograph1)
	(supports instrument11 spectrograph0)
	(calibration_target instrument11 GroundStation1)
	(calibration_target instrument11 Star3)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet7)
	(supports instrument12 spectrograph1)
	(supports instrument12 spectrograph0)
	(calibration_target instrument12 Star3)
	(supports instrument13 spectrograph0)
	(supports instrument13 spectrograph1)
	(calibration_target instrument13 Star0)
	(supports instrument14 spectrograph1)
	(calibration_target instrument14 GroundStation1)
	(calibration_target instrument14 Star0)
	(on_board instrument12 satellite5)
	(on_board instrument13 satellite5)
	(on_board instrument14 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation2)
	(supports instrument15 spectrograph1)
	(calibration_target instrument15 GroundStation2)
	(calibration_target instrument15 GroundStation1)
	(supports instrument16 spectrograph1)
	(supports instrument16 spectrograph0)
	(calibration_target instrument16 GroundStation4)
	(calibration_target instrument16 Star5)
	(supports instrument17 spectrograph1)
	(calibration_target instrument17 Star0)
	(calibration_target instrument17 Star5)
	(on_board instrument15 satellite6)
	(on_board instrument16 satellite6)
	(on_board instrument17 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Planet7)
)
(:goal (and
	(pointing satellite6 Planet11)
	(have_image Planet6 spectrograph0)
	(have_image Planet7 spectrograph1)
	(have_image Planet8 spectrograph1)
	(have_image Phenomenon9 spectrograph0)
	(have_image Phenomenon10 spectrograph0)
	(have_image Planet11 spectrograph0)
	(have_image Phenomenon12 spectrograph0)
))

)

; plan
1. (turn_to satellite6 groundstation4 planet7)
   deleted: (pointing satellite6 planet7)
   added: (pointing satellite6 groundstation4)
   goals met: 0 of 8
2. (switch_on instrument16 satellite6)
   deleted: (power_avail satellite6)
   added: (power_on instrument16)
   goals met: 0 of 8
3. (calibrate satellite6 instrument16 groundstation4)
   added: (calibrated instrument16)
   goals met: 0 of 8
4. (turn_to satellite6 planet7 groundstation4)
   deleted: (pointing satellite6 groundstation4)
   added: (pointing satellite6 planet7)
   goals met: 0 of 8
5. (take_image satellite6 planet7 instrument16 spectrograph1)
   added: (have_image planet7 spectrograph1)
   goals met: 1 of 8
6. (turn_to satellite6 planet6 planet7)
   deleted: (pointing satellite6 planet7)
   added: (pointing satellite6 planet6)
   goals met: 1 of 8
7. (take_image satellite6 planet6 instrument16 spectrograph0)
   added: (have_image planet6 spectrograph0)
   goals met: 2 of 8
8. (turn_to satellite6 phenomenon9 planet6)
   deleted: (pointing satellite6 planet6)
   added: (pointing satellite6 phenomenon9)
   goals met: 2 of 8
9. (take_image satellite6 phenomenon9 instrument16 spectrograph0)
   added: (have_image phenomenon9 spectrograph0)
   goals met: 3 of 8
10. (turn_to satellite6 phenomenon12 phenomenon9)
   deleted: (pointing satellite6 phenomenon9)
   added: (pointing satellite6 phenomenon12)
   goals met: 3 of 8
11. (take_image satellite6 phenomenon12 instrument16 spectrograph0)
   added: (have_image phenomenon12 spectrograph0)
   goals met: 4 of 8
12. (turn_to satellite6 phenomenon10 phenomenon12)
   deleted: (pointing satellite6 phenomenon12)
   added: (pointing satellite6 phenomenon10)
   goals met: 4 of 8
13. (take_image satellite6 phenomenon10 instrument16 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   goals met: 5 of 8
14. (turn_to satellite6 planet8 phenomenon10)
   deleted: (pointing satellite6 phenomenon10)
   added: (pointing satellite6 planet8)
   goals met: 5 of 8
15. (take_image satellite6 planet8 instrument16 spectrograph1)
   added: (have_image planet8 spectrograph1)
   goals met: 6 of 8
16. (turn_to satellite6 planet11 planet8)
   deleted: (pointing satellite6 planet8)
   added: (pointing satellite6 planet11)
   goals met: 7 of 8
17. (take_image satellite6 planet11 instrument16 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 8 of 8
